{
  "navbar": {
    "name": "Josh",
    "about": "About",
    "experience": "Experience",
    "resume": "Resume",
    "contact": "Contact",
    "projects": "Projects",
    "language": "言語"
  },
  "landing": {
    "greeting-one": "Hello, I'm",
    "greeting-two": " Josh",
    "greeting-three": ".",
    "role-array": [
      "I'm a Full Stack Developer",
      "I'm a Japanese Enthusiast",
      "I'm a React Developer",
      "I'm based in Canada",
      "Click the button to start!"
    ]
  },
  "about": {
    "paragraph": "Hello! My name is Josh and I'm a junior software engineer based in New Brunswick, Canada. I'm knowledgeable in full-stack development, specifically with React, Node and TypeScript.\n I have a passion for learning Japanese aswell with the ultimate goal of becoming a software engineer in Japan!\nIn my spare time you can usually find me at my computer studying Kanji decks or working on a new React project!",
    "download": "Download My Resume!"
  },
  "experience": {
    "moncton": "Moncton, New Brunswick, Canada",
    "tokyo": "Tokyo, Japan",
    "general-data": "Created an internal full-stack application with React, TypeScript Node.js, CSS, Tailwind, and Retrieval Augmented Generation. Deployed and managed a full-stack application using CI/CD, GitHub Actions, and Microsoft Azure services. Developed a bankruptcy processing form in React, using TypeScript and Tailwind CSS, tailored to client-specific needs. Integrated form state management and validation for a seamless and error-resistant user experience. Coordinated backend enhancements using Node.js for custom API logic and data handling.",
    "hennge": "Created an admin dashboard Using React, TypeScript, and CSS along with a variety of libraries such as React Query. Deployed the application using CI/CD, and GitHub Actions. Set up an AWS environment with Terraform, S3, CloudFront, and Route53 to support the deployment of the application. Participated in daily standups with engineering team to discuss and solve issues."
  },
  "projects": {
    "kana-typer-title": "Kana Typer",
    "kana-typer-description": "Kana Typer is a web app that helps users learn the main two Japanese phonetic systems, Hiragana & Katakana.\n The user can select individual symbols, specific categories, or the entire system to study and review!",
    "japan-job-scraper-title": "Japan Job Scraper",
    "japan-job-scraper": "Japan job scraper is a web scraper I built for my own personal use that scraps a list of Japanese job boards and filters their compatability with me and send its to a React front-end!\n The scraper has been set to run weekly and update the front-end only with the new jobs so I can constantly see new jobs being posted without having to sort through multiple sites manually!"
  },
  "contact": {
    "title": "Contact Me!"
  }
}
