{
  "navbar": {
    "name": "Josh",
    "about": "About",
    "experience": "Experience",
    "resume": "Resume",
    "contact": "Contact",
    "projects": "Projects",
    "language": "言語"
  },
  "landing": {
    "greeting-one": "Hello, I'm",
    "greeting-two": " Josh",
    "greeting-three": ".",
    "role-array": [
      "I'm a Full Stack Developer",
      "I'm a Japanese Enthusiast",
      "I'm a React Developer",
      "I'm based in Canada",
      "Click the button to start!"
    ],
    "start": "Get Started"
  },
  "about": {
    "header": "About",
    "paragraph-one": "Hello! My name is Josh and I'm a junior software engineer based in New Brunswick Canada. I'm knowledgeable in full-stack development, the tools I use are usually React, Node, TypeScript, CSS, and Python along with some others!",
    "paragraph-two": "I currently work for an IT company in Saint John, New Brunswick called General Data Professionals where I work as a full-stack developer. I've also previously worked an internship at a Tokyo based company called HENNGE as a front-end developer.",
    "paragraph-three": "Aside from my passion for programming, I also love studying the Japanese language because my ultimate goal is to have the opportunity to become a software engineer in Japan!",
    "paragraph-four": "In my free time you can usually bet on me being busy, studying Kanji and Japanese grammar, or working on some new projects. Some of which you can see below :)",
    "download": "Download My Resume!"
  },
  "experience": {
    "header": "Experience",
    "moncton": "Moncton, New Brunswick, Canada",
    "tokyo": "Tokyo, Japan",
    "general-data": "Created an internal full-stack application with React, TypeScript Node.js, CSS, Tailwind, and Retrieval Augmented Generation. Deployed and managed a full-stack application using CI/CD, GitHub Actions, and Microsoft Azure services. Developed a bankruptcy processing form in React, using TypeScript and Tailwind CSS, tailored to client-specific needs. Integrated form state management and validation for a seamless and error-resistant user experience. Coordinated backend enhancements using Node.js for custom API logic and data handling.",
    "junior-full-stack": "Junior Full-Stack Developer",
    "hennge": "Created an admin dashboard Using React, TypeScript, and CSS along with a variety of libraries such as React Query. Deployed the application using CI/CD, and GitHub Actions. Set up an AWS environment with Terraform, S3, CloudFront, and Route53 to support the deployment of the application. Participated in daily standups with engineering team to discuss and solve issues.",
    "front-end-intern": "Front-end Developer Intern"
  },
  "projects": {
    "header": "Projects",
    "kana-typer-title": "Kana Typer",
    "kana-typer-description": "Kana Typer is a web app that helps users learn the main two Japanese phonetic systems, Hiragana & Katakana.\n The user can select individual symbols, specific categories, or the entire system to study and review!",
    "japan-job-scraper-title": "Japan Job Scraper",
    "japan-job-scraper": "Japan job scraper is a web scraper I built for my own personal use that scraps a list of Japanese job boards and filters their compatability with me and sends it to a React front-end! The scraper has been set to run weekly and update the front-end only with the new jobs that have been posted within the last week so I can constantly see new job postings without having to sort through multiple sites manually!"
  },
  "contact": {
    "header": "Contact",
    "title": "Contact Me!",
    "reach-out": "Feel Free to Reach Out!",
    "send-msg": "Send Messaege",
    "name": "Enter Your Name",
    "email": "Enter Your Email",
    "message": "Enter Your Message"
  }
}
